In [22]:
import numpy as np
import pandas as pd

In [23]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [24]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [25]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [26]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

# Working with Dates

In [27]:
date['date'] = pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract year

In [28]:
date['date_year'] = date['date'].dt.year
date.sample(5)

          date  product_id  city_id  orders  date_year
156 2019-04-25         568        8      25       2019
643 2019-05-31        7561       21       1       2019
402 2018-11-05        4347       25     131       2018
446 2019-06-28        5430       14       7       2019
926 2019-07-07        6640       26      48       2019

#### 2. Extract Month

In [29]:
date['date_month'] = date['date'].dt.month
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month
944 2019-07-26        4439        2      24       2019           7
640 2018-11-03        3161       21       1       2018          11
948 2018-08-04        5389       24       2       2018           8
309 2019-08-14        4352       16       1       2019           8
72  2018-08-27        7582       17      30       2018           8

In [30]:
date['date_month_name'] = date['date'].dt.month_name()
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month,date_month_name
707,2019-07-06,2247,16,9,2019,7,July
130,2019-07-12,2242,8,2,2019,7,July
312,2018-09-14,7011,9,11,2018,9,September
44,2018-08-03,803,23,9,2018,8,August
892,2019-12-07,1564,13,96,2019,12,December

#### Extract Days

In [31]:
date['date_day'] = date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [32]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [33]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [34]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

#### Extract week of the year

In [37]:
date['date_week'] = date['date'].dt.isocalendar().week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,quarter,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#### Extract Quarter

In [36]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

In [ ]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

#### Extract Time elapsed between dates

In [38]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2026, 2, 4, 18, 3, 18, 377939)

In [39]:
today - date['date']

0     2248 days 18:03:18.377939
1     2730 days 18:03:18.377939
2     2661 days 18:03:18.377939
3     2363 days 18:03:18.377939
4     2586 days 18:03:18.377939
                 ...
995   2676 days 18:03:18.377939
996   2617 days 18:03:18.377939
997   2465 days 18:03:18.377939
998   2530 days 18:03:18.377939
999   2304 days 18:03:18.377939
Name: date, Length: 1000, dtype: timedelta64[ns]

In [40]:
(today - date['date']).dt.days

0      2248
1      2730
2      2661
3      2363
4      2586
       ...
995    2676
996    2617
997    2465
998    2530
999    2304
Name: date, Length: 1000, dtype: int64

In [51]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'D')/30.44,0)

0      74.0
1      90.0
2      87.0
3      78.0
4      85.0
       ...
995    88.0
996    86.0
997    81.0
998    83.0
999    76.0
Name: date, Length: 1000, dtype: float64

In [42]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [43]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [45]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

#### Extract Time part

In [46]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [47]:
today - time['date']

0     4434 days 17:13:18.377939
1     4298 days 18:23:18.377939
2     4784 days 17:42:18.377939
3     4086 days 17:32:18.377939
4     4483 days 18:52:18.377939
                 ...
995   5073 days 17:13:18.377939
996   4394 days 18:49:18.377939
997   4859 days 18:26:18.377939
998   4975 days 18:29:18.377939
999   4247 days 18:38:18.377939
Name: date, Length: 1000, dtype: timedelta64[ns]

In [48]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.831596e+08
1      3.714134e+08
2      4.134013e+08
3      3.530935e+08
4      3.873991e+08
           ...
995    4.383692e+08
996    3.797094e+08
997    4.198840e+08
998    4.299066e+08
999    3.670079e+08
Name: date, Length: 1000, dtype: float64

In [49]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.385993e+06
1      6.190223e+06
2      6.890022e+06
3      5.884892e+06
4      6.456652e+06
           ...
995    7.306153e+06
996    6.328489e+06
997    6.998066e+06
998    7.165109e+06
999    6.116798e+06
Name: date, Length: 1000, dtype: float64

In [50]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      106433.221772
1      103170.388438
2      114833.705105
3       98081.538438
4      107610.871772
           ...
995    121769.221772
996    105474.821772
997    116634.438438
998    119418.488438
999    101946.638438
Name: date, Length: 1000, dtype: float64